Repository: haibuiorg/housing-management-flutter
Catalog: lib/l10n/app_*.arb
Languages: fi

source: Account Management
fi: Tilinhallinta

source: Save
fi: Tallenna

source: Notification Setting
fi: Ilmoitusasetukset

source: Change Password
fi: Vaihda salasana

source: Terms of Use
fi: Käyttöehdot

source: Privacy Policies
fi: Tietosuojakäytännöt

source: Logout
fi: Kirjaudu ulos

# logout_confirm
source: Are you sure you want to logout?
fi: Haluatko varmasti kirjautua ulos?

source: Cancel
fi: Peruuta

source: Password change failed
fi: Salasanan vaihto epäonnistui

# password_change_failed_detail
source: Something wrong with your password, please make sure you enter correct password and new password must be strong enough
fi: Jotain meni pieleen salasanassasi, varmista, että syötät oikean salasanan ja uuden salasanan on oltava tarpeeksi vahva

source: Password change success
fi: Salasanan vaihto onnistui

# password_change_success_detail
source: When password successfully change, you will be logged out!
fi: Kun salasana on vaihdettu onnistuneesti, sinut kirjataan ulos!

# password_change_title
source: Want to change your password?
fi: Haluatko vaihtaa salasanan?

# password_change_subtitle
source: Enter your old password and new password
fi: Syötä vanha salasana ja uusi salasana

source: Confirm
fi: Vahvista

source: Change
fi: Vaihda

source: Admin
fi: Ylläpitäjä

# company_with_name
source: Company {companyName}
fi: Yhtiö {companyName}

# name
source: Name: {name}
fi: Nimi: {name}

# message
source: Message: {message}
fi: Viesti: {message}

source: Add Subscription Plan
fi: Lisää tilauspaketti

source: Add Payment Product Plan
fi: Lisää maksutuote paketti

source: Plan: {name}
fi: Paketti: {name}

# price_value
source: Price: {price}
fi: Hinta: {price}

# description_text
source: Description: {description}
fi: Kuvaus: {description}

source: Remove
fi: Poista

# product_name
source: Product: {productName}
fi: Tuote: {productName}

source: Add Payment Product
fi: Lisää maksutuote

source: Monthly Price
fi: Kuukausihinta

source: Yearly Price
fi: Vuosihinta

source: SMS Notification
fi: SMS-ilmoitus

source: Email Notification
fi: Sähköposti-ilmoitus

source: Document Translation
fi: Dokumentin käännös

source: Has Apartment Documents
fi: Onko asuntokirjat

source: Create New Subscription Plan
fi: Luo uusi tilauspaketti

source: Announcement
fi: Ilmoitus

source: Also send email
fi: Lähetä myös sähköposti

source: Submit
fi: Lähetä

source: Water Invoices
fi: Vesilaskut

source: More
fi: Lisää

source: Fault Report
fi: Vikailmoitus

source: Archived Invoices
fi: Arkistoidut laskut

source: Add Water Consumption
fi: Lisää vedenkulutus

source: Register with code
fi: Rekisteröidy koodilla

source: Register
fi: Rekisteröidy

# add_manager
source: Add Managers
fi: Lisää hallinnoijia

source: Email
fi: Sähköposti

source: First Name
fi: Etunimi

source: Last Name
fi: Sukunimi

source: Phone Number
fi: Puhelinnumero

source: Apartment
fi: Huoneisto

source: Add
fi: Lisää

source: Create a Housing Community
fi: Luo asuinyhteisö

source: What is your housing community name?
fi: Mikä on asuinyhteisösi nimi?

source: Documents
fi: Dokumentit

source: Load More
fi: Lataa lisää

# remove_event_confirm
source: Are you sure you want to remove this event?
fi: Haluatko varmasti poistaa tämän tapahtuman?

source: Remove Event
fi: Poista tapahtuma

source: Accepted
fi: Hyväksytty

source: Declined
fi: Hylätty

source: Maybe
fi: Ehkä

source: Upload
fi: Lataa

source: Forgot Password
fi: Unohditko salasanan

source: Send
fi: Lähetä

source: Invited
fi: Kutsuttu

source: Send Invitation
fi: Lähetä kutsu

source: Help
fi: Apua

source: Country
fi: Maa

source: Language
fi: Kieli

source: Join with invitation code
fi: Liity kutsukoodilla

source: Create New Channel
fi: Luo uusi kanava

# start_new_channel
source: Start New Topic
fi: Aloita uusi aihe

source: Channel Name
fi: Kanavan nimi

source: Polls
fi: Kyselyt

source: Communication Topic
fi: Viestintäaihe

source: Renovation Requests
fi: Remonttipyynnöt

source: New Invoice
fi: Uusi lasku

# manange
source: Manage
fi: Hallinnoi

source: No data
fi: Ei tietoja

source: Payments
fi: Maksut

source: Add Bank Account
fi: Lisää pankkitili

# subscribe_to
source: Subscribe to {name}
fi: Tilaa {name}

source: Subscription
fi: Tilaus

source: Appearance
fi: Ulkoasu

source: Send Invoice
fi: Lähetä lasku

source: Invoice created
fi: Lasku luotu

source: Send new invoice
fi: Lähetä uusi lasku

source: Add Item
fi: Lisää kohde

source: Payment Terms
fi: Maksuehdot

source: Send Email
fi: Lähetä sähköposti

# invoice_groupd
source: Invoice Group
fi: Laskuryhmä

source: Invoices
fi: Laskut

source: Resend Invoice
fi: Lähetä lasku uudelleen

# send_invoice_to
source: Send invoice to {email}
fi: Lähetä lasku osoitteeseen {email}

source: Join apartment with invitation code
fi: Liity huoneistoon kutsukoodilla

source: Login failed
fi: Kirjautuminen epäonnistui

source: Login
fi: Kirjaudu

source: That's OK
fi: Se on OK

source: Join this channel
fi: Liity tähän kanavaan

# join_channel_confirm
source: Are you sure you want to join this channel?
fi: Haluatko varmasti liittyä tähän kanavaan?

source: Join
fi: Liity

source: Sure!
fi: Totta kai!

source: Notification Center
fi: Ilmoituskeskus

# vote_option_error
source: You must select at least one option
fi: Sinun on valittava vähintään yksi vaihtoehto

source: Create New Poll
fi: Luo uusi kysely

source: Add Vote Option
fi: Lisää äänestysvaihtoehto

source: Anonymous Poll
fi: Anonyymi kysely

# participant_add_option
source: Participant can add options
fi: Osallistuja voi lisätä vaihtoehtoja

# remove_poll_confirm
source: Are you sure you want to remove this poll?
fi: Haluatko varmasti poistaa tämän kyselyn?

# remove_option
source: Remove this option
fi: Poista tämä vaihtoehto

source: Clear
fi: Tyhjennä

# multipl_options
source: Participant can select multiple options
fi: Osallistuja voi valita useita vaihtoehtoja

source: Manage Participants
fi: Hallitse osallistujia

source: Remove Poll
fi: Poista kysely

source: Poll loading...
fi: Kysely latautuu...

source: Dark Theme
fi: Tumma teema

source: Confirm Date & Time
fi: Vahvista päivämäärä & aika

source: Download
fi: Lataa

source: Water Consumption
fi: Vedenkulutus

source: Current Water Price
fi: Nykyinen vesihinta

source: Add New Water Price
fi: Lisää uusi vesihinta

source: Water Price History
fi: Vesihinnan historia

# current_water_bill
source: Current Water Bill Period
fi: Nykyinen vesilaskukausi

# start_new_water_bill
source: Start New Water Bill Period
fi: Aloita uusi vesilaskukausi

source: Start
fi: Aloita

source: Contact Us
fi: Ota yhteyttä

# send_me_demo_account
source: Send me a demo account
fi: Lähetä minulle demotili

source: Message sent
fi: Viesti lähetetty

source: Message sent error
fi: Viestin lähettäminen epäonnistui

# name_title
source: Name
fi: Nimi

# price_title
source: Price
fi: Hinta

# price_value_in
source: Price (value) in {currency}
fi: Hinta (arvo) {currency}

# cost_per_invoice
source: Additional cost per invoice {value}
fi: Lisäkustannus per lasku {value}

source: Max messaging channels
fi: Maksimi viestintäkanavat

source: Max announcements
fi: Maksimi ilmoitukset

source: Max invoice number
fi: Maksimi laskun numero

source: Title
fi: Otsikko

source: Subtitle
fi: Alaotsikko

source: Content
fi: Sisältö

# create_apartment_question
source: How many account do you want to create?
fi: Kuinka monta tiliä haluat luoda?

source: Quantity
fi: Määrä

# email_address_error
source: Invalid email address
fi: Virheellinen sähköpostiosoite

# message_title
source: Message
fi: Viesti

# name_error
source: Invalid name
fi: Virheellinen nimi

# phone_error
source: Invalid phone number
fi: Virheellinen puhelinnumero

source: Old Password
fi: Vanha salasana

source: New Password
fi: Uusi salasana

source: Building Name
fi: Rakennuksen nimi

# number_of_apartment_in_building
source: Number of apartments in building
fi: Asuntojen lukumäärä rakennuksessa

# aparment_house_number
source: Apartment/house number
fi: Asunnon/talon numero

source: Building number
fi: Rakennuksen numero

source: Consumption value
fi: Kulutusarvo

source: Invitation code from manager
fi: Kutsukoodi isännöitsijältä

source: Create a password
fi: Luo salasana

# company_name_title
source: Company name
fi: Yrityksen nimi

source: Event name
fi: Tapahtuman nimi

source: Event description
fi: Tapahtuman kuvaus

source: Support subject
fi: Tukiaihe

source: Street address line 1
fi: Katuosoite rivi 1

source: Street address line 2
fi: Katuosoite rivi 2

source: City
fi: Kaupunki

source: Postal code
fi: Postinumero

source: Business ID
fi: Y-tunnus

# iban_error
source: Invalid IBAN
fi: Virheellinen IBAN

# bic_swift_error
source: Invalid BIC/SWIFT
fi: Virheellinen BIC/SWIFT

source: Invoice name
fi: Laskun nimi

source: Item name
fi: Tuotteen nimi

# description_title
source: Description
fi: Kuvaus

source: Tax rate
fi: Verokanta

# total_title
source: Total
fi: Yhteensä

source: Item description
fi: Tuotteen kuvaus

source: Unit price
fi: Yksikköhinta

source: Total: {value}
fi: Yhteensä: {value}

# code_title
source: Code
fi: Koodi

# password_title
source: Password
fi: Salasana

# password_error
source: Invalid password
fi: Virheellinen salasana

source: Poll name
fi: Kyselyn nimi

source: Poll description
fi: Kyselyn kuvaus

# vote_option_title
source: Option for participants
fi: Vaihtoehto osallistujille

# vote_option_value
source: Option: {value}
fi: Vaihtoehto: {value}

source: Voting poll detail
fi: Äänestyskyselyn tiedot

# vote_ends_by
source: Vote ends by {time}
fi: Äänestys päättyy {time}

# your_vote_title
source: Your vote:
fi: Äänesi:

# participants_name
source: Participants: {names}
fi: Osallistujat: {names}

source: Ended by {time}
fi: Päättynyt {time}

# ended_by_title
source: Ended by:
fi: Päättäjä:

# participants_select_multiple
source: Participants can select multiple options
fi: Osallistujat voivat valita useita vaihtoehtoja

source: Voting option description
fi: Äänestysvaihtoehdon kuvaus

# email_list_hint
source: Emails to send invitation to (separate with ; or ,)
fi: Sähköpostiosoitteet kutsun lähettämiseen (erottele ; tai ,)

# total_basic_fee_with_value
source: Total basic fee: {value}
fi: Yhteensä perusmaksu: {value}

source: Total reading
fi: Yhteensä lukema

# total_reading_with_value
source: Total reading: {value}
fi: Yhteensä lukema: {value}

source: per cube
fi: kuutiota kohti

source: Basic fee
fi: Perusmaksu

# basic_fee_with_value
source: Basic fee: {value}
fi: Perusmaksu: {value}

source: Contact lead
fi: Yhteyshenkilö

source: Housing Companies
fi: Asuntoyhtiöt

source: Conversations
fi: Keskustelut

source: Messages
fi: Viestit

source: Subscription Plans
fi: Tilaussuunnitelmat

# contact_lead_detail
source: Name {name} Email {email} Phone {phone}
fi: Nimi {name} Sähköposti {email} Puhelin {phone}

source: Payment products
fi: Maksutuotteet

# product_detail
source: Product: {name} Price: {price}
fi: Tuote: {name} Hinta: {price}

# make_annoucement_title
source: Make an announcement to all residents
fi: Tee ilmoitus kaikille asukkaille

# water_invoice_for
source: Water invoice for {month}
fi: Vesilasku {month} kuukaudelle

source: Remove this apartment
fi: Poista tämä asunto

source: Period
fi: Jakso

source: Year
fi: Vuosi

# period_with_value
source: Period: {value}
fi: Jakso: {value}

# year_with_value
source: Year: {value}
fi: Vuosi: {value}

# progess_with_value
source: Progress: {value}
fi: Edistyminen: {value}

source: Price per cube
fi: Hinta kuutiota kohden

# price_per_cube_with_value
source: Price per cube: {value}
fi: Hinta kuutiota kohden: {value}

source: Consumption this period
fi: Kulutus tällä jaksolla

source: Not yet updated
fi: Ei vielä päivitetty

source: Invoice this period
fi: Lasku tältä jaksolta

source: Add consumption value
fi: Lisää kulutusarvo

source: Invalid code or email
fi: Virheellinen koodi tai sähköposti

source: None
fi: Ei mitään

# start_at_title
source: Start at
fi: Alkaa

source: Start at {time}
fi: Alkaa klo {time}

# until_title
source: Until
fi: Kunnes

source: Until {time}
fi: Kunnes klo {time}

source: Repeat until {time}
fi: Toista kunnes klo {time}

source: Edit
fi: Muokkaa

source: Loading
fi: Ladataan

source: Event Detail
fi: Tapahtuman tiedot

source: Create an event
fi: Luo tapahtuma

# reset_password_success
source: If email provided is correct an email will be sent to you for resetting password instruction
fi: Jos sähköpostiosoite on oikea, sinulle lähetetään sähköposti salasanan vaihtamisohjeilla

source: Reset password
fi: Nollaa salasana

# reset_password_instruction
source: Please enter your email address to reset your password
fi: Anna sähköpostiosoitteesi nollataksesi salasanasi

# event
source: Event calendar
fi: Tapahtumakalenteri

# remove_company_confirm
source: Are you sure you want to remove this company?
fi: Haluatko varmasti poistaa tämän yrityksen?

# country_with_name
source: Country: {name}
fi: Maa: {name}

source: Payment bank account
fi: Maksutili

source: User management
fi: Käyttäjähallinta

source: Company branding
fi: Yrityksen brändäys

# delete_housing_company
source: Remove housing company
fi: Poista asuntoyhtiö

# delete_bank_account
source: Remove bank account
fi: Poista pankkitili

# delete_bank_account_confirm
source: Are you sure you want to remove this bank account?
fi: Haluatko varmasti poistaa tämän pankkitilin?

# subscribe_quantity_question
source: How many apartment do you want to create?
fi: Kuinka monta asuntoa haluat luoda?

source: Company credit: {amount}
fi: Yrityksen luotto: {amount}

source: Current subscription
fi: Nykyinen tilaus

source: Available subscriptions
fi: Saatavilla olevat tilaukset

# subscription_detail
source: Subscription for: {quantity} apartments
fi: Tilaus: {quantity} asuntoa

source: Active
fi: Aktiivinen

# subscription_unpaid
source: (Invoice not paid - click to pay!)
fi: (Lasku ei maksettu - klikkaa maksamaan!)

source: Company logo
fi: Yrityksen logo

source: Cover photo
fi: Kansikuva

source: Primary color
fi: Ensisijainen väri

source: Invoice sent
fi: Lasku lähetetty

# reference_number_title
source: Reference number:
fi: Viitenumero:

# status_title
source: Status:
fi: Tila:

# items_title
source: Items:
fi: Tuotteet:

# amount_title
source: Amount:
fi: Määrä:

source: Payment due
fi: Maksun erääntyminen

# payment_due_date
source: Payment due date: {date}
fi: Maksun eräpäivä: {date}

source: Bank accounts
fi: Pankkitilit

# receivers
source: Receivers {name}
fi: Vastaanottajat {name}

# item_with_name
source: Item: {name}
fi: Tuote: {name}

# item_with_description
source: Description: {description}
fi: Kuvaus: {description}

# quantity_with_value
source: Quantity: {value}
fi: Määrä: {value}

# tax_rate_with_value
source: Tax rate: {value}
fi: Verokanta: {value}

source: Select apartment
fi: Valitse asunto

# incomplete_water_period
source: Warning! Current period is not completed!
fi: Varoitus! Nykyinen jakso ei ole valmis!

# notification_permission_message
source: Do you want to receive notification when there are new important announcements or when something require your action?
fi: Haluatko saada ilmoituksen, kun on uusia tärkeitä tiedotteita tai kun jokin vaatii toimiasi?

source: Settings
fi: Asetukset

# admin_panel
source: Admin
fi: Ylläpito

# from_compamies
source: From companies
fi: Yrityksiltä

source: Fault reports
fi: Vikailmoitukset

source: Support requests
fi: Tukipyynnöt

source: Get more apartments
fi: Hanki lisää asuntoja

source: Subscribe
fi: Tilaa

# add_apartment
source: Add apartment to {name}
fi: Lisää asunto kohteeseen {name}

source: Autofill apartment number
fi: Täytä asunnon numero automaattisesti
